Repository: alexeyosychencko/cook-with-ai-bot
Catalog: locales/*/LC_MESSAGES/mybot.po
Languages: ru, uk

source: Cuisine
ru: Кухня
uk: Кухня

source: Calories
ru: Калории
uk: Калорії

source: Product list
ru: Продукты
uk: Список продуктів

source: Dish
ru: Блюдо
uk: Страва

source: Get recipe
ru: Получить рецепт
uk: Отримати рецепт

source: Clear selected
ru: Очистить выбранное
uk: Очистити обране

source: Hello, it's your cooking bot!
ru: Привет! Я ваш кулинарный помощник!
uk: Привіт, це ваш кулінарний асистент!

source: 1. Specify your preferences such as cuisine, calorie range, ingredients, or dish name. 2. Click the "Get Recipe" button to generate your customized recipe. 3. Wait a moment while Bot works its magic. 4. Voila! Your personalized recipe is ready for you to explore and enjoy. 5. Skip specifying parameters and let Bot surprise you with a random recipe.
ru: 1. Укажите свои предпочтения, такие как кухня, калорийность, ингредиенты, или название блюда. 2. Нажмите кнопку "Получить рецепт", чтобы создать свой индивидуальный рецепт. 3. Подождите немного, пока Bot работает, это магия. 4. Вуаля! Ваш персональный рецепт готов, изучайте и наслаждайтесь 5. Не указывайте параметры и позвольте боту удивить вас случайным рецептом.
uk: 1. Вкажіть свої уподобання, такі як кухня, калорійність, інгредієнти, або назва страви. 2. Натисніть кнопку "Отримати рецепт", щоб створити свій рецепт. 3. Зачекайте трохи, поки Bot працює. 4. Вуаля! Ваш персональний рецепт готовий, вивчайте та насолоджуйтесь 5. Не вказуйте параметри і дозвольте боту здивувати вас випадковим рецептом.

source: Select the cuisine type:
ru: Выберите тип кухни:
uk: Оберіть тип кухні:

source: Enter the number of kCal:
ru: Введите количество kCal:
uk: Введіть кількість kCal:

source: Enter a set of products:
ru: Введите набор продуктов:
uk: Введіть набір продуктів:

source: Enter the name of the dish:
ru: Введите название блюда:
uk: Введіть назву страви:

source: Please wait!
ru: Пожалуйста подождите!
uk: Будь ласка, зачекайте!

source: Processing the order!
ru: Обрабатываем заказ!
uk: Опрацьовуємо замовлення!

source: It's coming up! Wait...
ru: Уже скоро! Подождите...
uk: Вже скоро! Зачекайте...

source: Ops! Something wrong! Press /start
ru: Опс! Что-то не так! Нажмите /start
uk: Щось не так! Натисніть /start.

source: Cleared
ru: Очищено
uk: Очищено

source: Selected dish recommendations!
ru: Выбранные рекомендации!
uk: Обрані рекомендації!
